HiD/_posts/Perl/2013-06-20-Perl-debug-misc.html
---
layout: tech-post
title: Perl5 debug杂记
category: Perl
change_frequency: monthly
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Debug tricks</a>
<ul>
<li><a href="#sec-1-1">Readline - 设置Readline处理</a></li>
<li><a href="#sec-1-2">PadWalker - 自动补全</a></li>
<li><a href="#sec-1-3">在Emacs内调试Perl</a></li>
<li><a href="#sec-1-4">调试正则表达式</a></li>
<li><a href="#sec-1-5">提前设置断点</a></li>
<li><a href="#sec-1-6">配置perl5db初始化</a></li>
<li><a href="#sec-1-7">Enbugger - 运行时debug</a></li>
<li><a href="#sec-1-8">指定debugger模块</a></li>
<li><a href="#sec-1-9">设置最大调用深度</a></li>
</ul>
</li>
<li><a href="#sec-2">Debug 相关文档</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Debug tricks</h3>
<div class="outline-text-3" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1">Readline - 设置Readline处理</h4>
<div class="outline-text-4" id="text-1-1">

<p>    默认的perl5db 如果没有安装Term::ReadLine模块，不支持历史命令、行编辑等类似bash命令行的功能。<br/>
    解决办法是通过安装相应的ReadLine模块:
</p>


<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">on Linux</span>
cpanm Term::ReadLine::Gnu
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">on other platform</span>
cpanm Term::ReadLine::Perl <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#32431;perl&#23454;&#29616;</span>
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2">PadWalker - 自动补全</h4>
<div class="outline-text-4" id="text-1-2">

<p>    命令 行自动补全、词法变量自动补全等补全功能，安装PadWalker模块:
</p>


<pre class="src src-sh">cpanm PadWalker
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3">在Emacs内调试Perl</h4>
<div class="outline-text-4" id="text-1-3">

<p>    Emacs 可以高亮Perl语法，可以在调试的同时，看到高亮后的代码，有较好的阅读性
</p></div>

</div>

<div id="outline-container-1-4" class="outline-4">
<h4 id="sec-1-4">调试正则表达式</h4>
<div class="outline-text-4" id="text-1-4">

<p>    在代码的开头添加：
</p>


<pre class="src src-perl"><span style="color: #00ffff;">use</span> <span style="color: #4186be;">re</span> <span style="color: #ffff00;">'debug'</span>;
</pre>

<p>
    更多请参看："Debugging Regular Expressions" <a href="http://search.cpan.org/~rjbs/perl-5.18.0/pod/perldebguts.pod#Debugging_Regular_Expressions">perldebguts</a>
</p></div>

</div>

<div id="outline-container-1-5" class="outline-4">
<h4 id="sec-1-5">提前设置断点</h4>
<div class="outline-text-4" id="text-1-5">

<p>    在希望中断执行的地方，添加:
</p>


<pre class="src src-perl">$DB::single = 1;
</pre>

<p>
    然后通过 <code>-d</code> 命令选项来启动程序，当运行到上诉语句的时候，程序进入debug中断状态，提示 <code>&lt;DB&gt;</code> 提示符
</p></div>

</div>

<div id="outline-container-1-6" class="outline-4">
<h4 id="sec-1-6">配置perl5db初始化</h4>
<div class="outline-text-4" id="text-1-6">

<p>    perl5db在初始化时，会读取一些配置文件和环境变量来设置自身：
</p><ul>
<li>non-interactive - 非交互<br/>
      perl5db.ini
</li>
<li>interactive - 交互<br/>
      .perldb
</li>
<li>PERLDB_OPTS - 环境变量
</li>
</ul>

</div>

</div>

<div id="outline-container-1-7" class="outline-4">
<h4 id="sec-1-7">Enbugger - 运行时debug</h4>
<div class="outline-text-4" id="text-1-7">

<p>    注意：使用<a href="http://search.cpan.org/perldoc?Enbugger">Enbugger</a>模块，并不需要以 <code>-d</code> 运行选项启动程序
</p><ul>
<li>通过在程序中执行:



<pre class="src src-perl"><span style="color: #00ffff;">require</span> <span style="color: #4186be;">Enbugger</span>;
</pre>

<p>
      程序进入debug模式，提示 <code>&lt;DB&gt;</code> 提示符
</p></li>
<li>还可以指定要使用的debugger:



<pre class="src src-perl"><span style="color: #00ffff;">use</span> <span style="color: #4186be;">Enbugger</span> <span style="color: #ffff00;">'perl5db'</span>;
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">or</span>
Enbugger-&gt;load_debugger(<span style="color: #ffff00;">'perl5db'</span>);
</pre>

<p>
      目前支持:perl5db和<a href="https://github.com/rocky/Perl-Devel-Trepan">trepan</a> 两个debugger
</p></li>
<li>支持信号触发的debug：



<pre class="src src-perl"><span style="color: #00ffff;">use</span> <span style="color: #4186be;">Enbugger::OnError</span> <span style="color: #66cd00;">qw</span><span style="color: #ffff00;">( __DIE__ USR1)</span>; <span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#22312;__DIE__ &#21644; USER1 &#20449;&#21495;&#21457;&#29983;&#26102;&#36827;&#20837;debug&#27169;&#24335;</span>
</pre>

</li>
<li>支持通过<a href="http://search.cpan.org/~jjore/Enbugger-2.013/lib/Enbugger.pod#From_gdb">gdb进入debug模式</a>:<br/>
      即通过gdb将运行中的perl程序trace，然后执行perl内部函数，加载Enbugger模块，然后Enbugger模块被执行，进入了debug模式
</li>
</ul>

</div>

</div>

<div id="outline-container-1-8" class="outline-4">
<h4 id="sec-1-8">指定debugger模块</h4>
<div class="outline-text-4" id="text-1-8">

<p>    可以通过 <code>-d:Debugger</code> 来指定 Debugger 模块代替默认的perl5db进行debug
</p></div>

</div>

<div id="outline-container-1-9" class="outline-4">
<h4 id="sec-1-9">设置最大调用深度</h4>
<div class="outline-text-4" id="text-1-9">

<p>    默认情况下，如果subrutine调用深度超过100，DB就会中断执行，进入断点，可以通过 <code>$DB::deep = 500;</code> 设置深度为500，在大于500的调用深度下，DB自动进入暂停执行。
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Debug 相关文档</h3>
<div class="outline-text-3" id="text-2">

<ul>
<li><a href="http://search.cpan.org/perldoc?perl5db.pl">perl5db.pl</a> - the perl debugger
</li>
<li><a href="http://search.cpan.org/perldoc?perldebtut">perldebtut</a> - Perl debugging tutorial
</li>
<li><a href="http://search.cpan.org/perldoc?perldebug">perldebug</a> - Perl debugging
</li>
<li><a href="http://search.cpan.org/perldoc?perldebguts">perldebguts</a> - Guts of Perl debugging
</li>
</ul>

</div>
</div>
